Revit 2027 API
BuiltInFailures.SlantedColumnFailures.CannotCutParallelToLocationCurve Property
 Cut plane of slanted column end is parallel to the location curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCutParallelToLocationCurve { get; }
Public Shared ReadOnly Property CannotCutParallelToLocationCurve As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCutParallelToLocationCurve {
	FailureDefinitionId^ get ();
}
static member CannotCutParallelToLocationCurve : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SlantedColumnFailures Class
Autodesk.Revit.DB Namespace